[{"text": "Forgot to post this the other night. Ran into my man @zabjudah in NYC. Weird running into him at a Broadway play. #DoinWhatIDo #Zab #GetSome", "label": []}, {"text": "DRESS: @fashionnova 'When the Bass Drops' dress. (code: XOBRITTANIE for 15% off.)\n-\n\nSHOES: @publicdesire 'Billie' heels.", "label": []}, {"text": "We’re better when we’re together 💫✨ @DevinBrugman and I in the latest @MondaySwimwear Campaign", "label": []}, {"text": "Drenched 💦 Swimming in the Water Drench Hyaluronic Cloud Cream from @peterthomasrothofficial 🏊‍♀️ this hydrating moisturizer (a 30% Hyaluronic Acid Complex Cream!) will quench the thirst your skin has been craving! #CloudCreamCrew #sponsored #WaterDrench #esthetician {ZOOM for HD pores} #Complexionsbyjade", "label": []}, {"text": "Happy Valentine’s Day to my one and only! I love you @lockon27!! #AllYouNeedIsLove", "label": []}, {"text": "CONGRATULATIONS TO \n@alexandramcfly @angelarosegonzalez @niinaleee @raising.little.lexi @haley.earley  please email us over at hello@wildbird.co!!! Thank you to everyone that participated!!! Sooooo many amazing entries! 🙌🏽🥰✨🦋 🎶 ✨ ”you are the dancing queen, young and sweet, stuck in quarantine” ✨🎶 We could all do with a boost of endorphins and all the happy feels right?! 🥳\n\nSo let’s dance away!!!! And make it a Giveaway too! 🙌🏽✨ Post a video to your feed or stories dancing to Abbas Dancing Queen! \nBe sure to have the song playing from a separate speaker! Not a must but would be pretty amazing if you’re (safely) slinging your babe! Jam away, have fun with it and just let loose! 😍\n\nTag us so we can repost and make sure to use the hashtag #DancingQuaranqueenWithWildBird\n\nTag friends in the comment section and have them join as a bonus entry 🤭❣️ Giveaway ends April 3rd 7pm MT! \nWe will choose FIVE WINNERS! We will gift you a sling of your choice AND $100 cash!!! ❣️🙌🏽 Happy Dancing 🕺🏻👯‍♀️💃🏻", "label": []}, {"text": "Sitting pretty #hollywoodhills \n#elegance is the way forward \n#gown by @eliemadi @forthestarsfashionhouse \n#losangeles #beverlyhills #la #hollywood #california #usa #elegant #chic #glamour #hautecouture #🇺🇸", "label": []}, {"text": "Three weeks until I once again shock the world.... @allelitewrestling #AllOut #PainmakerVsHangman", "label": []}, {"text": "I like my lashes long hby?🦋😍 Lash style “Brandie” @kleoluxe.co \nBraids: @shaythestylist___", "label": []}, {"text": "Wow here’s  something you don’t see much of anymore... #DVDRentals #BeKindRewind", "label": []}, {"text": "For all my MMA and combat sports fans out there go give @vukoje.mma a follow for some action packed content 👊🏻🤙🏼", "label": []}, {"text": "I know I know, so NOT fall (said all my insta girlies 😱🤷🏼‍♀️sorry!) but it’s still in the 90’s in Cali so bringing it back to that time at @miramonteresort in Palm Desert! Linked up a bunch of suits like this in LTK that so many of you asked about, and all are on sale for under $20! In case it’s still summer wherever you are 👙😎🍹. Girls fits + sunnies are from @thedaydreamrepublic .\n\nhttp://liketk.it/2EG4u #liketkit @liketoknow.it #LTKfamily #LTKswim @liketoknow.it.family .\n\n#miramonteresort #miramontemoments", "label": []}, {"text": "No matter where I am in the world I always have a bottle of @cocoabrowntan by @marissacarter with me 💁🏼‍♀💕#sponsoredbutiloveit When I’m on holiday I tend to use their 1 Hour Mousse #UltraDark to get the deepest, richest tan possible and I like to use their Golden Goddess Oil on my chest to get a natural shimmer ✨ Get yours now @superdrug  #TeamCB #CocoaBrownTan #BrandAmbassador", "label": []}, {"text": "WeWoreWhat Swim Spring 20 Collection • HOME • designs and prints inspired by elements from my home and favorite interior design. What you can expect: this silhouette print inspired by the many female body sculptures that can be found in my apartment, marbles, cowhide, florals and more... @shopweworewhat 03.16", "label": []}, {"text": "Eyes are the window to the soul 👁 Love my @lorealmakeup Pro Last Liner for a Smokey wing & X Fiber mascara for extreme length + volume! #Lorealleaguepartner #makeup", "label": []}, {"text": "#ad This @flattummyapp is making sure I’m staying on track to my 2020 goals while in isolation. 🏋🏽‍♀️🧘🏾 It’s got all you need… access to 450+ at home workouts, 750+ healthy recipes, and a forum of women to keep you motivated at all times. Go download this app and get started for free 📲", "label": []}, {"text": "Green for the win #lastnight \nWearing @mackage coat (got it from Nordstrom)", "label": []}, {"text": "When you think you’re still in the Hamptons 🤷🏻‍♀️ full outfit via @nordstrom • shop http://liketk.it/2wt69 #liketoknowit @liketoknow.it #ad #nordstrom", "label": []}, {"text": "What a perfect day en route to Minga Lodge to meet with @metowe ♥️ The river was absolutely breathtaking, stopped through some markets along the way with my girls/ got some snacks and handcrafted goods, & am ready to explore the amazon! Swipe for a glimpse into my day 🇪🇨 @pacsun #PACcares _____________________________________________________________  Que dia tan perfecto en ruta a “Minga Lodge” para encontrarme con la fundacion @metowe. El rio se lo ve bello, paramos en unos cuantos mercados con mis amigas y compramos bocaditos y artesanias y ahora si estoy lista para explorar la amazonia! @pacsun #PACcares", "label": []}, {"text": "✨Glistening Gaze for Days ✨ Obsessed with the shimmer pay off from the new LUX Diamond Creme Shadows from @LORACcosmetics 💎 Made from real diamonds 💎 I’m wearing shades Satin and Lace! Get yours now @ultabeauty #glam #LORACLuxDiamond #loracpartner", "label": []}, {"text": "Glammed up to celebrate the #BoF500 (signature hair and make up by me 🤓 in exactly 14 minutes in the car)", "label": []}, {"text": "#ad Happy Saturday friends! I took this rusty bike out for a spin on the boardwalk. It’s so fun to get out of the city for a while to clear your mind. ⁣🌴🚲\n⁣\nI looove being glam and going out all the time, but it’s so nice to hang by the beach and get back down to earth. It’s the perfect place to listen to the MFCEO podcast, too. @1stPhorm #1stphorm CEO @AndyFrisella puts out episodes every week! If you’re looking for advice on success, business, relationships and life in general- this is the podcast for you. ⁣\n⁣\nCheers to the weekend and a clear mind 🧘🏼‍♀️", "label": []}, {"text": "Today on WWW • getting ready for Fall with @7fam available at @bloomingdales", "label": []}, {"text": "Damn! The Double Cheeseburger from @bixibeer in Chicago is 🔥! Stopped here because our flight was delayed 3 hours and we are SO HAPPY it was. Hahaha. Tag a friend who loves to @devour.burgers! #DEVOURPOWER\n▶️ YouTube: DevourPowerTV", "label": []}, {"text": "Adelaide, Perth, Melbourne & Brisbane, I can’t wait to be running my Muscle Mechanics Workshops throughout February. I’ve updated everything and created a jam packed 2-day event that goes deep into my repertoire on everything training related.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nBiomechanics, Breathing & Bracing, Assessments and Corrective Exercises, Activation Drills, Lagging Body Parts, Mobility, Warm Ups, Exercise Selection, Rehab, Coaching Cues and of course putting it all together into Long Term Periodisation and Program Design for muscle building, strength, sports performance and longevity. ⠀⠀⠀⠀⠀⠀⠀⠀⠀\nI want you walking away with as much immediately useable, practical information as possible.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nEarly Bird rates are available for one more week only!\nFor more details and full course breakdown, head to the link in my bio.", "label": []}, {"text": "Us, together, doing absolutely nothing at home. Most exciting plans we’ve had all week.😉🙌🏼 ps THANK YOU ALL for your support in me keepin it real in yesterday’s post. It meant more to me than I can say.  #lit_fam_love\n\nUse code SARAHL20 for 20% off anything on the @vicidolls site! Cutest new arrivals dropped last night. 💕  #vicidolls #vicicollab .\n.\n.\n.\n.\n\n#bigfamily #mama #familyovereverything #kidsfashion #mommybloggers #mommylife #momtog #motherhoodunplugged #momitforward #childhoodunplugged #letthembelittle #momswithcameras #photooftheday #thehappynow #mytinymoments #flashesofdelight #chooselovely #livethelittlethings #lovelysquares #holdthemoments #dailyparenting #uniteinmotherhood #clickinmoms #candidchildhood", "label": []}, {"text": "I don’t want anyone saying “I knew it” for #tbt this was a blind date. This lovely young lady asked me to her school dance. I guess she saw me at a basketball game & we had mutual friends. They gave her my number she called me. First time we met was at her house to take pictures before the dance. I believe her name was Margie. Keep in mind his was before social media so I had no clue what she looked like. But I figured it would be cool to go to another high school dance. See what the kids were like. #BlindDate #EdgewoodHS #GetSome", "label": []}, {"text": "what is my problem? they matched my bag, so it was a sign i needed em. ¯\\_(ツ)_/¯", "label": []}, {"text": "23 years Ago: #DoYouWantMore was released. Roots Factoids:\n1st Song Recorded: #MellowMyMan\nLast Song Recorded: Intro/TheresSomethinGoinOn\n1st Song Mixed: Mellow My Man\nLast Song Mixed: The Lesson Pt 2\nSong That Didn’t Make It Last Minute: Change The Beat (Interlude)\nSong That Shoulda Made It: The Ultimate\nFavorite Video: Distortion To Static\nFavorite Video To Make: Proceed Pt2\nOriginal Title: Home Grown\nLongest Song To Record: The Session Pt 2 (20 min posse cut)\nShortest Song: Swept Away (tape ran out)\n11t hour idea: Make Lazy Afternoon the same verse and drop Malik & Quest’s verses!”\nBest remix: Silent Treatment (Kick The Ball Version)\nShoulda Coulda: Distortion Remix (ran outta tape after first verse)\nRegrets: Silent Treatment shoulda had a better video", "label": []}, {"text": "All the love to @korenthemp for stepping up #ad link in bio💫", "label": []}, {"text": "Fantastic Pink coming to theaters 😉 near you #GoodGirl @carolinaherrera 💕🎟🧠👄", "label": []}, {"text": "Beaten down and battered. \nTHANK YOU TO EVERYONE who put in the extremely long work hours all weekend with me to shoot the finishing touches for our action thriller SKYSCRAPER. \nThe crew, co-stars, studios, filmmakers and the sea of hard working extras who helped me make these scenes come alive. \nVery bittersweet to hear my director @rawsonthurber call “cut” for the last time because it signified an end to the most demanding role I’ve ever had the luck of playing. \nThank you everyone again. \nGrateful man to hear that FINAL BELL. \nSKYSCRAPER JULY 13th\n📸: @hhgarcia41", "label": []}, {"text": "A night in San Francisco 💋 I am so excited to meet all of the @createcultivate attendees and share more of my story... #moreofwhatmatters \nTop: @storets \nPants : @jacquemus \nShoes: @gianvitorossi \nEarrings: @sachinandbabi\nBag: @tarazadeh \nStyled By: @monicarosestyle \nMakeup: @themariavee", "label": []}, {"text": "In real life, I can put on a MasterClass about the countless times I’ve had use my fear of something as a valuable weapon to overcome and succeed at it. \nOr I failed. \nFear is a good thing for all of us. It’s healthy. \nKeeps us sharp - depending on how we use it. \nWe examine a lil’ of that fear tonight. \n#ballers #hbo @1030pm.", "label": []}, {"text": "no wasted time in California 🌴 another trip out to the west coast for some much needed girls time & beach-side relaxation!! 💛🙌🏼 doing all the things from wig parties, long walks on the beach (awh), Disneyland & so much more!! see it all on my stories & LA highlight 💕 @liketoknow.it #liketkit http://liketk.it/2DZUA", "label": []}, {"text": "Im on a roll with these workouts  but they make me late for everything and my hair is always frizzy. Oh well.... sacrifice 🤷🏽‍♀️💦", "label": []}, {"text": "ALL THE PIZZA and a casual whiskey from @getsomehomie in Chicago! Unreal. Oh and some EPIC holiday decorations! 🎄💯 They seriously hooked it up. 🤤 Tag a friend who loves to aggressively @devour.pizza. 🍕🍕🍕🍕\n#DEVOURPOWER\n#DEVOURPOWERChicago\n▶️ YouTube: DevourPowerTV", "label": []}, {"text": "All fun and games last night getting with @misha212 and @lindashalabi for the @answerthecallnyc gala 💙❤️", "label": []}, {"text": "Omg @sony’s AIBO Robot dog is so cool and cute and WOW! We took them out on the town for a fun doggy day 🐶 @jennaezarik @ayfondo — we all made videos on our channels so go check em out!", "label": []}, {"text": "Who’s excited for tonight’s show?! Alex and I are taking over @boohoo’s Instastories tonight to give you our thoughts on the Villa! ❤️🏝 Outfit - @boohoo ✨ #ad", "label": []}, {"text": "Hey everyone, around the world! I want to make sure you know there are 7 days left to enter the @aimementoring contest to win 10 golden tickets for the chance to bring the #aimementoring program to YOUR COUNTRY. Help bring equal opportunities for success to youth regardless of their race, financial background, religion or gender. They have been doing incredible work in Australia and now they want to help CHANGE THE WORLD so go to @aimementoring to find out more or aimementoring.com  let's stand together and knockdown these walls between us and our greatest potential. So much love xx", "label": []}, {"text": "😂 My road manager @bradwilliams36 on EP62 of #GetSome Podcast with me and my dad to discuss: Getting robbed, getting knocked out, and more.\n➖➖➖➖➖➖➖➖➖➖\n📺 WATCH FULL VIDEO at https://YouTube.com/GaryOwenCom\n🎧 LISTEN on Apple #Podcasts, Google Play, or any #podcast app.", "label": []}, {"text": "Pride\nI wish I wasn’t in a box\nI wish they would\nLet me fly\nI wish they could see how beautiful all the colors are up here in the sky. \nThe big and shiny and bright ones, their all the things I love. \nI wish they could feel the radiance that exudes thru me from being my most self. \nI guess I didn’t think this thru \nWhy they wouldn’t love me.. or you? \nI wish they could understand why me and not she or he or them. That this is my decision of who I am. \nI wish they could see me \nWith a lidless box. I wish they could see me. \nMaybe not today or tomorrow \nMaybe when they do time will stop \nAnd then I’ll be free of this disgusting box.  #thelifeofawannabemogul", "label": []}, {"text": "“We are built & bred different at the crib, salute to all the youngins from @floridafirefootball on their journey to reach the biggest stage of them all, in the meantime the jokes gone fly every time we cross paths” ®️\n📸: @allamericanfilm", "label": []}, {"text": "Thankful & grateful today and everyday ❤️🎄🤗 Ready to spend Friendsgiving with my girls and @VictoriasSecret\nSee Full story on @WhoWhatWear in December! 🎅🏽\n.\n.\n #ad @VictoriasSecret #DreamLikeAnAngel", "label": []}, {"text": "<a little bit of sunshine, spots and spades ♠️// this new @katespadeny bucket bag is ready to be on repeat!> #loveinspades #ad #katespade", "label": []}, {"text": "Rebecca’s first time at the Lollipop Korean Chicken Spot @landbirdschicago was a SUCCESS. 🍗🔥 This place rules! Tag a friend who loves to aggressively @devour.friedchicken! #DEVOURPOWER\n▶️ YouTube: DevourPowerTV", "label": []}, {"text": "YAS LEOPARD 😩❤ my Jersey Girl Romper- link in bio‼️ @thesnookishop", "label": []}, {"text": "<it’s here!! I put all my favorite colorful dresses and accessories for spring all in ONE place 🎨 // see and shop my @amazonfashion finds on Atlantic-Pacific today or visit the link in my profile!> #amazonfashion #ad video by @samcannon http://liketk.it/2vL8E", "label": []}, {"text": "The fun of matching just about quadrupled with the season!🌲Beanies n boots x 4 = YAY! 💁🏼‍♀️👩🏼👧🏼👧🏼 .\n\nFollow me on the LIKEtoKNOW.it shopping app to get the product details for this look and others http://liketk.it/2HQ9Q #liketkit @liketoknow.it #LTKholidaystyle #LTKfamily #LTKkids @liketoknow.it.family #ltkbump", "label": []}, {"text": "#TBT to boo & I after a wild night at Karma in 2010.", "label": []}, {"text": "Opening up the signature Double Cheeseburger from @hamburger.stan at their Denver location! 🍔🍔 Fresh ground, griddle-cooked double patty, American cheese, white onion, fresh dill, secret sauce, buttery bun. 🤤 Who loves to @devour.burgers as much as we do?! 🙋‍♀️🙋‍♂️ #DEVOURPOWER\n▶️ YouTube: DevourPowerTV\n👇🏼 TAG A DEVOURER! 👇🏼", "label": []}, {"text": "Yo @eminem lays low then all the sudden BAM reminds everyone why he's a living legend. Every time I'm in a parking garage I'm gonna wanna bust a freestyle now. #DoinWhatIDo #MarshallDoesItAgain #GetSome", "label": []}, {"text": "\"When it all comes down to a sunrise on the east side\"", "label": []}, {"text": "Hey Dallas! I’m hosting the first SMOOTH THURSDAYS night at Villa Lounge! THIS THURSDAY come hang with ya girl at this hot spot @villaloungedallas ! We’re starting early so come meet me after work and come have a happy hour drink and vibe! I all starts at 7pm (cause we all gotta work in the morning!) 15375 Addison Rd in Addison, Texas 75001 ! 💜💜💜💜💜", "label": []}, {"text": "Which would you choose: 1 or 2? Comment below! #DEVOURPOWER\n🌯1️⃣: The BEAST WRAP! Charcoal grilled steak wrapped in a turmeric dough. Bbq crunch, blue cheese, marinated green olives, cilantro, red chili mayo.\n🌯2️⃣: The DIRE WOLF WRAP! Fried chicken wrapped in a ginger dough. Lamb bacon, melted cheddar, green papaya slaw, spicy pickled shipka peppers, wolf ketchup®.\n▶️ YouTube: DevourPowerTV\n👉🏼 TikTok: DevourPowerTV", "label": []}, {"text": "Another rainy day but my curated @gilt sale ends soon and I added a few more pieces to it so check it out! #gotitongilt #ad", "label": []}, {"text": "Technical Difficulties won’t stop me!! Go to the Roots YouTube page I’m playing ALL THE GOOG SLOW JAMS THERE!!", "label": []}, {"text": "Good Morning! It's very nearly the weekend 🙌🏼 what are your plans? 🌿", "label": []}, {"text": "Sunset - last evening 🌾 enjoying long walks by myself, calling a friend, listening to music, a podcast or just  nature ..", "label": []}, {"text": "Got a visit from my JUNGLE CRUISE ❤️ ohana on the set of HOBBS & SHAW here in London. \nThese two good lookin’ aliens have a lot going on. \nMy partner in crazy, Emily Blunt/ the woman who’s delivering one of the greatest Christmas gifts of all time with her iconic turn as the one and only, MARY POPPINS in theaters Dec 19th. \nAnd @jackwhitehall who not only has his own NETFLIX special, but delivering an early Christmas gift as well in Disney’s THE NUTCRACKER in theaters Nov 2nd — and so defiant he wears my IRON PARADISE weightlifting belt backwards and dares someone to tell him he’s wrong. \nAnd finally, the big, brown, bald tattooed deadbeat in the middle who doesn’t have shit going on in his life and his biggest claim to fame is telling the world its classy to drink tequila before noon. \nAlways good to see their faces. \nCuz asses ain’t kickin’ themselves. \n#MaryPopPop #TequilaBeef #ActionJack\n#TheDisrupters", "label": []}, {"text": "It didn’t go quite to plan but here we are. 🤣🤣", "label": []}, {"text": "My favorite place in the world, my own bed 🤤😏 sleeping #inmynewcasper @casper 💫☁️", "label": []}, {"text": "My knight in shining armor 💗 \n#DateNight #HeyThereHandsome http://liketk.it/2tnvq #liketkit @liketoknow.it #RHOD", "label": []}, {"text": "I'll give you one simple tool to refocus, reprioritize and get back on track here: DarrenHardyBroadcast.com (LINK IN BIO)", "label": []}, {"text": "You guys kept messaging me to go to @allanticovinaiofirenze, so I did and doubled down on two sammies. Escusa while I inhale these.", "label": []}, {"text": "a simple sequence for shoulder opening and neck stretching, enjoy 🙏🏼✌🏼 #yoga #yogapractice #yogainspiration", "label": []}, {"text": "Just a friendly reminder that the 🍔 at @smallcheval in Chicago is extremely DEVOUR-worthy. Tag a friend who loves to @devour.burgers! 💪🏼\n#DEVOURPOWER\n#DEVOURPOWERChicago\n▶️ YouTube: DevourPowerTV", "label": []}, {"text": "So earlier this fall I gave a preview of a new song at @capahs & thought as a holiday treat I’d share what we been working on for the past few 🥳\n\nThank you @citizensbank for putting together that amazing event at my alma mater CAPA. The kids loved it and I always love giving back to the school that gave so much to me.\n\nAs i said earlier i played a snippet of a new Roots song called “Feel It (You Got It)” that we created for the #madeready campaign.  We collabed with the talented #TIshHyman (follow @listen2tish) for this gem. You can click the bio link on @TheRoots page to hear is the fulll song on @spotify (it’s on all the streaming formats btw) thank you for listening #ad", "label": []}, {"text": "My Beautiful Giiirls- From all over the 🌍 — 🎶 #gotnothingonyou #wcw #BrunoMars #24karat", "label": []}, {"text": "In honor of the one year anniversary of \"Body Positivity\", here is a snippet our lyric video for \"Body Positivity (part ii: Electropoint Redux), sung by myself, @adambarta and @thekandymuse, and produced by @electropointmusic.  Available now for download on iTunes and Amazon Music. I love you all! #bodypositivity #teameureka\n#beyourselftofreeyourself  #PHAT #carebear #elephantqueen #🐘👑 #amazons #phatfashionicon  #season10 #rupaulsdragrace\nAlways stay updated on my website at www.eurekatheelephantqueen.com", "label": []}, {"text": "WIN the ultimate Coachella experience😱 including 2 x access ALL areas artist passes😵 for you and your BFF! 😍💘🌴\nStep 1: Follow @PrettyLittleThing \nStep 2: tag a BFF to take with you in their competition post 👭\nWinner announced on #prettylittlething Instastory 14.01.18", "label": []}, {"text": "Hot messes playing Burpee Catch with the ball. Jesus take the wheel. @abogofit @legacy_athletic_club", "label": []}, {"text": "#bts @katyperry #chainedtotherhythm music video ⭐️⚡️ ⚡️#tbt\n👗 @bcompleted 💅🏻 @kimmiekyees 💇 @shonju 💄 @hungvanngo", "label": []}, {"text": "Still 75 and sunny in West Hollywood, California. Perfect day to be outside 🌴The best part about an outdoor workout for me is usually, the privacy. Whether a hike or run, I can go at my pace because I'm not packing into a room of people who I think are (but probably aren't) looking at me while I workout. .\n.\nI think if you're looking to get fit for a New Year's resolution- getting a head start now is a great idea. You can take it slow and at your own pace with an outdoor walk, hike or run. You can also prepare by stocking up on your favorite supplements. One of mine is my @1stPhorm apple juice flavored BCAA I like to sip throughout my workouts. Helps with recovery from workouts and muscle growth. You don't have to wait until the 1st to start treating your body right. Get outdoors and get started today ☀️ #1stphorm 💪🏽", "label": []}, {"text": "What topping do you put on your hotdog before you 100% DEVOUR it?! Introducing the @jcrewmens x @newbalance “Relish Summer” Sneakers! Swipe for a closer look! #DEVOURPOWER #ad 📸: @anishaspice", "label": []}, {"text": "<nothing says Monday like a little sparkle ✨ and shine 💫> bag: @thewebster #TheWebsterWay As always shop the look with the link in my bio 🛍", "label": []}, {"text": "\"I Got You\" music video out now. Link in bio! 🌵🔥⭐️🌪🏜", "label": []}, {"text": "No ponytails for me anytime soon. Chopped 💇🏽 // @domdomhair", "label": []}, {"text": "LONDON WE'RE COMING FOR YA! 🇬🇧All of our U.K. babes are invited to join us for a weekend of shopping and fun at our A Bikini A Day Pop Up Shop! ❤ Get personally styled by us in brand new @mondayswimwear and @mondayactive ! 😍 We're so excited to be bringing our pop up shop to the U.K. for the first time after so many requests! Please make sure to RSVP your guests email addresses as well as what day you plan to attend to RSVPlondon@abikiniaday.com See you there!!! X #ABikiniADayPopUp", "label": []}, {"text": "Flashbacks. File under public places, extreme touch, crowds and close encounters. ♡ ♡ ♡", "label": []}, {"text": "@winnieharlow x @thelovemagazine 🌸 💗.\n📷 @philpoynter \nCD @kegrand \nCasting @bitton @establishmentny\n👗 @hotchowchow\n💅🏻 @rockstarnailgrlkellyb\n💇 @benskervin\n💄 @hungvanngo @marcbeauty \n#HappyTenthBirthdayLove 💗💗", "label": []}, {"text": "\"You can only fight the way you practice\" Miyamoto Musashi #martialarts#miyamoto#musashi#katana#swordsman#training#quote#trainhard#zen", "label": []}, {"text": "This is one of my favourite @skinrepublicuk  masks💆🏼‍♀️#sponsoredbutiloveit Its deffo a must after heavy makeup, it dives deep into pores and removes dirt and impurities, available at @superdrug 💖 AND its also in the cute Christmas gift set that I showed you guys on IGTV!", "label": []}, {"text": "Two Double ShackBurgers & Bacon Cheese Fries from @shakeshack because it’s Sunday and cheat days are very, very real. 🍔🍔\n#DEVOURPOWER\n#DEVOURPOWERNYC\n▶️ YouTube: DevourPowerTV", "label": []}, {"text": "It didn’t go quite to plan but here we are. 🤣🤣", "label": []}, {"text": "This is me right after someone says I be doing way tew much... Ma'am. Sir. You haven't seen shit. Hold my purse. Stand back while I thoroughly enjoy my life while you comment on my joy. LIVE LOVE LAUGH folks! Thank you @dance_n_out for this timely reminder. Keep shining #GabBeingGab", "label": []}, {"text": "Don’t forget I’m House of Gryffindor Baby!! I’m actually gonna be playing Hagrid’s wife in the new movie. “The Cursed Child” ⚡️⚡️⚡️⚡️", "label": []}, {"text": "My music video debut!!!🤗😎How'd I do ??? ( w/ @justinroberts44 @remyboymonty1738 @johannes.r.bartl #AmandaCerny )", "label": []}, {"text": "We did it! Even w a sneaky toddler running around and 4 #quarantined crazies surrounding me 🤪. If this is the only thing I get done for a month, I call it victory. 🤜🏻🤛🏻\n.\n\nFor all the details on the girls’ closet sitch, follow me on LIKEtoKNOW.it, and for more tips on dealing w small closet madness head to my stories!  http://liketk.it/2LILX #liketkit @liketoknow.it #LTKfamily #LTKkids #LTKhome @liketoknow.it.family #closetorganization #kidscloset #organization #momblogger #mama", "label": []}, {"text": "I'm known to love a messy bouncy hair doo! For people that ask what I use and do for my textured look - these babies from @wella_shockwaves are my go to for easy style! Simply have your hair in a bun overnight, take out in the morning, spray with and bobs your uncle. Again - for volume my fave handy spray gives you bounce on the move! Effortless and sexy! #StyleTheMoment #Ad", "label": []}, {"text": "Sauced up @brinechicken with Crinkle Cut 🍟s. Just the way we like it! Tag someone who would love this.\n#DEVOURPOWER\n#DEVOURPOWERNYC\n▶️ YouTube: DevourPowerTV", "label": []}, {"text": "<don’t let the smile fool you - I am soaking wet and freezing 🙃// but at least I like my outfit 😜> This look now on Atlantic-Pacific http://liketk.it/2uUDY #fairisle #jcrewstyle #sorel #thundersnow", "label": []}, {"text": "👫 Hey guys, here's a recap video we put together from our stay at the @mo_marrakech this 5️⃣ star luxury resort provided us with some of the best recent travel memories we have. The entire experience was arranged by the resort and it was amazing! Special thanks to @mo_hotels for this world-class Morrocan escape. #ImAFan #ad", "label": []}, {"text": "<It is a polka dot party over on Atlantic-Pacific today with @mytheresa.com and you are invited // ain't no party like a polka dot party> #Mytheresa #ad #polkadots #vacaystyle @shopstyle", "label": []}, {"text": "Eat your heart out 💀💔 LOVE this Halloween glam I created🥀 What should I film next? Crown & Jewels by @mariannaharutunian | Link in bio for tutorial! xx", "label": []}, {"text": "my full body strength challenge starts today! this week practice each one of the classes from my new Full Body Strength plan on @codyapp, post about it using the hashtag #fullbodystrengthchallenge and you will be entered to win a 3 month subscription to @codyapp - winners will be chosen on monday may 21st so hop on your mat and get after it! #yogalife", "label": []}, {"text": "I’ll bring the Spark, You bring the drink⚡️ @fashionnova #ootn", "label": []}, {"text": "The four factors that directly affect your life's outcomes...⠀\nLearn this and more in my morning mentoring program with 350K+ achievers each morning.⠀\nJoin us here: https://buff.ly/2Ub3lRD", "label": []}, {"text": "“If we are going to be the best business of our kind in the world, we’ve got to be in New York” said Blake Nordstrom.. this quote is epicly thought provoking for so many reasons right now! Loved visiting the new @nordstrom • http://liketk.it/2GBaD #liketkit @liketoknow.it #ad #nordstrom", "label": []}, {"text": "【MUSES】@cassblackbird is taking bets on which of my fellow @theofficialpandora powerwoman muses won this Danish carnival game from set of the campaign shoot [SPOILER ALERT: @georgiamayjagger and I lost]", "label": []}, {"text": "This week’s #SaturdaySmolder look....\nJust Calvin’s and sweatpants, but anything shot in Bermuda by the amazing @themichaeldowns will turn out fine 📸🌴🙌 who’s ready to see the previously unreleased shots from this trip soon!? 🤔😏\n•\n#returnofthemalesupermodel #ck #mycalvins #themichaeldowns #allamericanguys #aag #bermuda #wbffpro", "label": []}, {"text": "Ride 'em, cowboy!! 🐎\nThat moment when @brittanyfurlan finds one of your old stock photos on a magazine cover... 😱🙈 haha\n-\n#stockphotosneverdie #giddyup #saveahorserideacowboy", "label": []}, {"text": "💲Pure Happiness out here on my new Boat 💲 @midnightexpressboats 💲", "label": []}, {"text": "“My Body is not a political playground” T-shirt is here in mint w/ @chnge!! Long sleeve just in time for fall. Bundle up and fight the patriarchy!  Every shirt sold a portion of the proceeds are donated to my alma mater @amazinggraceconservatory a performing arts school in Los Angeles committed to empowering and educating youth through the performing arts. I feel so blessed and fortunate to have something I said turn into a opportunity to give back to a school that helped me find my voice politically and creatively. Thank you guys for all the support and to these amazing models who came out. More sizes coming very soon! Link in BIO💕💕", "label": []}, {"text": "Thank you @modelsdot for the feature. I am honored to be apart of the Industry Now series with such great company. Thank you @benhassett for the portrait 🖤. (Swipe ➡️)", "label": []}, {"text": "I don’t think any other exercise has single-handedly contributed more tissue to my legs than these.\nI used to do a variation of this back in High School - They were called Borzovs after Valeriy Borzov, the Olympic sprinter. After high school they disappeared for a long time until around April 2014 when @mountaindog1 introduced the world to the Bulgarian Split Squat Drop Set of Death - If you know, you know.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nI’ve followed @mountaindog1 since 2010. Being the faithful Mountain Pup I was back then, I would do that Drop Set as my Primary movement for legs. Every Damn Week. And my legs exploded. (Edit - I’ve just thrown that up into my story for the next 24 hours if you want to laugh at my pain). Fast forward through 2015-2016 when I added high intensity Squatting to the mix, my legs started looking ridiculous - scroll back if you care to see. The thing is, through my high volume squatting period, as these started disappearing again, that’s the exact moment a lot of those little ‘niggles’ started to accrue out of nowhere. ⠀⠀⠀⠀⠀⠀⠀⠀⠀\nIf there is one Lower body programming tip I could give you - for size, strength and mobility - it’s to prioritise these. I don’t care how you do it - Meadows style, Goblet Style, Barbell, DB or Borzovs - just do them. And get good at them. Your body will thank you. Today was paused reps. Instead of doing a straight set of 12 per side, do broken sets of 6 per side like I am - It’ll keep your reps more consistent and allow for heavier loading.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nIf you’re in California or Wisconsin, @mountaindog1 and I are coming to run a 3-day Workshop on all things Bodybuilding - Training, Nutrition, Supplementation & Contest Prep. Head to the link in my bio for details. Early Bird rates have been extended til the end of this week.", "label": []}, {"text": "hi i’m happy\n& i hope you are too cause you all deserve a life full of happiness&positivity🐷♡", "label": []}, {"text": "Do you know what is the most sabotaging force that destroys teams? I unveil this surprising success killer, as well as the 4 strategies to leading your team to greatness in this special training [LINK IN BIO]: https://buff.ly/2IKae6S", "label": []}, {"text": "I remember our first Christmas married, with no babies yet. It was weird, it took like 10 minutes for us to open our presents Christmas morning, and I remember thinking ‘so this is it? Where’s the crazy, fun morning-of excitement?’, dreaming of the day we’d hopefully have a houseful on Christmas. Well I think this is it. So grateful, so blessed, so livin my dream. —\n\n@allyssaashleephotography .\n.\n.\n.\n#mama #christmastree #familyovereverything #mommybloggers #mommylife #momtog #motherhoodunplugged #momitforward #childhoodunplugged #letthembelittle #momswithcameras #photooftheday #thehappynow #mytinymoments #flashesofdelight #chooselovely #thatsdarling #livethelittlethings #lovelysquares #holdthemoments #dailyparenting #teammotherly #uniteinmotherhood #clickinmoms #candidchildhood", "label": []}, {"text": "The SAMUARI MISO RAMEN in the making from @ryujin_brooklyn! 🍜🔥 Chicken and Pork Broth, Beansprouts, Onion, Ground Beef, Ground Pork, Garlic Paste, Ginger Paste, Bamboo Shoots, Soft Boiled Seasoned Egg, Seaweed, Roast Pork Loin and Scallion. 🤤 It’s #ramen season! #DEVOURPOWER\n👇🏼 TAG A DEVOURER! 👇🏼", "label": []}, {"text": "Oh This Post Gone Be Good. (I'm alive & in good hands #Aquarian @j.cole got us!)", "label": []}, {"text": "Exactly one year ago today I was blonde and in NYC AND...today I’m brunette and in LA😆 Someone also came up to me today and asked: “where’s all your fun colored hair!” 🙈 #opposite #coast & #haircolor #day", "label": []}, {"text": "Are you following @devour.kitchen? 👩‍🍳👨‍🍳 Here’s a simple recipe that’s actually really fun to make! Perfect for both children and adults. 🙌🏼 EGG IN A HOLE (or whatever you call it) HAM & CHEESE SANDWICH! And a bonus mini-sandwich video using the inner bread circles! 😂 #DEVOURPOWER\n——\n👇🏼 INGREDIENTS:\n- 2 slices of bread (we used whole wheat)\n- Something to puncture a circle hole (we used a mason jar)\n- 2 eggs\n- Hot sauce\n- Salt & pepper to taste\n- Red Pepper Chili Flakes\n- Butter\n- Sliced ham\n- Sliced provolone\n👇🏼 TAG A DEVOURER! 👇🏼", "label": []}, {"text": "Of course @fwrd x @rtabrand throw a party at a sex club. Wearing an RTA skirt and @ysl top via FWRD #lookfwrd #fwrdtravels", "label": []}, {"text": "First day of filming and we r already jumping trough the roof! 🎬🎬\n#setlife #bts", "label": []}, {"text": "<Sunday style file> highlighting a few easy weekend looks // all of these sweaters, jackets, and shoes are launching tomorrow on @nordstrom 💕 check out the full assortment PLUS a little surprise on Atlantic-Pacific (link in bio)", "label": []}, {"text": "This is weeks look is brought to you by (SHOUT OUTS TO!) @francdprvl for the t-shirt which captures a scene from which popular 90’s movie?...... Come on now, none of you better get this wrong!!!! 😏Shout out also to the 90’s babies. Getting Jiggy widit Holla Back Youngin Woot Woot👸🏾♥️♠️#thepocketqueen", "label": []}, {"text": "BBQ ribs before heading to the airport.. pasta for the next 3 days 🤫 yes or no?\n.\n.\nCostillitas antes de comer de mis cosas favoritas por tres días... pasta obvio🍝 🙈 #urgequeseacabeelfrio", "label": []}, {"text": "😋🧼🧴2 THINGS: We know I’m not going to sleep with my makeup on...🧼🧽🚿🧴 AND if you’ve known me for any amount of time you know I have trouble getting enough sleep🙈 My mom was literally telling me I need to start taking Lemon Balm, 5-HTP and magnesium to help me sleep and I had gotten the new @sugarbearsleep SLEEP GUMMIES and they had ALL the ingredients plus even more that my mom told me to take! Plus it’s like a little dessert for extra sweet dreams before you go get that beauty sleep! Thank you @sugarbearsleep #ad #sugarbearsleep #sweetdreams #beauty #sleep #always #wash #your #face #before #bed 😴🧼🛏", "label": []}, {"text": "Let's talk about our bamboo / linen sling. The bamboo sling comes soft and floppy, no breaking in required. It is a great sling for beginners because it's easy to thread though the rings and adjust. It very supportive and can last into toddlerhood. Let us know what questions you have about bamboo? #mywildbird #mywildbirdlovebird", "label": []}, {"text": "The road to the 🔝 continues...\nCurrently filming my badass movie @TheThinning 2: New World Order 💪🏼\nCOMING 2018", "label": []}, {"text": "@theinfluenceracademy FTW!… due to the current economic uncertainty we have partnered together to offer HUGE SCHOLARSHIPS on their certified programs for a short time only!! Just Go to the 🔗 in my bio, for all the  info💪🏼💯 #ad", "label": []}, {"text": "#ad My face when someone tells me they’ve never heard of @1stphorm protein bars 🙎🏼‍♀️ they’ve got 20g of protein in each bar and 6 layers of flavor. That’s why they actually LOOK and taste like a snack. Unlike other basic protein bars. I keep one in my purse at all times 😋 #1stphorm #legionofboom", "label": []}, {"text": "Had so much fun with the truly gorgeous @gigigorgeous (I ❤her) yesterday at @beautycon I got to host the @revlon stage and hug & meet you guys! You guys inspire me to keep making videos and I truly can't put into words what it means to get to hug you all in real life and when you guys share what I've meant to your hearts....each word is a sparkling treasure to me! Thank you for each time in person or in comments you share your words of love...you don't know how much it means to me. You all are the reason I started you and the reason I keep making videos! Huge thank you to @revlon for inviting me to host the stage and for my meet & greet so I could hug everyone! 💜💕#BeautyconNYC #Revlon #ad", "label": []}, {"text": "Airport vibes • NYC 🛫 LAX 🛫 Bahamas • hydrating before my flight with @fijiwater of course #ad", "label": []}, {"text": "Am dead exciting to be coming to @WeAreFSTVL this year! 😬🙅🏼🙆🏼All tickets are about to sell out…get them online now guys it's such a sick day 💃🏽#wearexclsv #wearefstvl", "label": []}, {"text": "Got it. Thanks @vaterdrumsticks ... Been holding me down for almost 10 years. You guys are the best ❤️❤️❤️❤️❤️❤️", "label": []}, {"text": "mom always said no candy for breakfast, but macaroons with mimosas in Paris calls for an exception 🥂❤️ #feelincultured #sorrymomanddentist #healthyeating 🙌🏼 day two of #amaryllisabroad & i cannot get enough of this beautiful place!! y’all can shop my looks from the trip with @amaryllis_apparel on my @liketoknow.it now!! #liketkit http://liketk.it/2FeVl #laduree #ladureeparis #ltkunder50 #ltkunder100 #ltkeurope", "label": []}, {"text": "The day will be what you make it, so rise like the sun and burn // @corey_wilson", "label": []}, {"text": "Just out here getting my Monday night chest pump 🎈🎈🎈\n•\nThis workout fueled by Hyde preworkout by @prosupps_llc 👹⚡️ I get mine from @taylorsville_nutrition; if you’re in Utah check them out and don’t forget to tell them I sent you to get 10% off your order! 💪\n-\n-\n#chestday #internationalbenchday #pecs #8weeksout #mondaymotivation #selfie #gnctaylorsville #wbffpro", "label": []}, {"text": "See you in 5 days NEW YORK! \nAll tickets sales will be 100% donated to LUPUS Foundation of America and LUPUS LA. \nGet your tickets 👉🏼 fwkidsshows.com/tickets", "label": []}, {"text": "Talking bout how stepping away from Hollywood for a while brought me peace, a job and happiness 💕💕 @bluecentric @melyssaford", "label": []}, {"text": "#ad Our mouths assist us with most, if not ALL, of our daily activities. Thankfully with @Listerine READY! Tabs you can go about your day without any worries that your mouth isn’t fresh for whatever comes your way. #ReadySwishGo", "label": []}, {"text": "One of the most important discoveries of my life!⠀\nWatch today's DarrenDaily message here ➡️ https://utm.io/ulpK⠀\n(Swipe UP ⬆️ in my IG stories for instant access)", "label": []}, {"text": "Throwback vibes, but dis real time! \n@carlbembridgehair Thankyou for my gorgeous new wig I’m obsessed! 🤷🏽‍♀️", "label": []}, {"text": "If you haven't been able to tell, I have been loving stripes lately, and the simple ways that you can dress them up or down. Head over to StephanieHollman.com or http://liketk.it/2qWEB to see the super chic cape I paired with this top ❤ Link is in my bio! Wishing you all the most amazing day! #ILoveNotHavingToChangeFromDayToNight #LazyGirlWin 😝 #liketkit @liketoknow.it #RHOD", "label": []}, {"text": "This goes out to @king55_tez @ajgreen_18 @employee96 @andydalton14 the season starts today. Come on fellas bring this W home. #DiehardFan #ItHurtsMySoul #GetSome", "label": []}, {"text": "been loving no eye makeup and a nude lip • wearing @hudabeauty flirt 👄 and @glossier boy brow 👁 got super minimal lashes by @christianzamorastudio too", "label": []}, {"text": "#ad We’ve made room on our grill for the delicious @morningstarfarms Meat Lovers Vegan Burger! Our favorite toppings include lettuce, tomato, onion, cheddar cheese and bbq sauce! What we love about these burgers is that they infuse juicy plant-based protein with summer flame-grilled flavor to deliver an eating experience that tastes just like meat. #DEVOURPOWER #morningstarfarms", "label": []}, {"text": "The best way to PREPARE to win your week is by spending 5-10 minutes using this single strategy: http://impact.darrenhardy.com/SUNPINGM⠀\n⠀\nThis strategy has skyrocketed my success (and hopefully will do the same for yours!) 🚀", "label": []}, {"text": "When you drive an hr and a half to the 🌻 fields, only to find they've been scorched away by triple digit temps. No choice but to find a 🍓field instead! Rollin with it, just like we do on this whole motherhood ride! @oldnavy #OldNavyStyle #sayhi #ad .\n.\n.\n.\n.\n\n#inspirepregnancy #stylishbump #thebump #ig_motherhood #bestofmom #clickinmoms #momtogs #momswithcameras #childhoodunplugged #candidchildhood #momsofinstagram #mom_hub  #ohheymama #flashesofdelight #humaneffect #jj_its_kids #letthekids #letthembelittle #nothingisordinary #ourchildrenphoto #our_everyday_moments #thewomoms #uniteinmotherhood #pixel_kids #igkids #holdthemoments #littleandbrave", "label": []}, {"text": "Playing a game of stunt with my crazy friends wasn’t a good idea 😅 go and watch the whole video on my YouTube channel to see why. The link is in my bio.\n.\n🎥 @dominick_hughes\n.\n#TMPST #freerunning #athlete #stunt #stunts #stuntman", "label": []}, {"text": "Nothing ever feels better than home does 💫🌅 Sunshine in my hair thanks for @colorbymattrez @buddywporter", "label": []}, {"text": "📸Baby got back 🚘 . .\n. •\n•\n•\n🚘 #cars #car #bugatti #ride #drive #driver #sportscar #vehicle #vehicles #street #road #freeway #highway #sportscars #exotic #exoticcar #exoticcars #speed #carporn #tires #spoiler #muffler #humanbarbie #racing #wheel #wheels #marcelaiglesias #rims #engine #horsepower", "label": []}, {"text": "In honor of #EarthWeek, @green4ema (of which I am a Board Member) and @harvardcchange connected me with Dr. Aaron Bernstein to discuss the connection between #climatechange, public health and #COVID19. You can watch the full conversation on the #EnvironmentalMediaNetwork’s YouTube channel (link in @green4ema bio).", "label": []}, {"text": "dang flabbit my S is backwards!! 🥂 was just going to share that this best selling dress is back in stock!! 💛 ALSO i have a giveaway for y’all!! FALL SHOPPING SPREE!! 🙌🏼 // Fall is officially here, so I’ve teamed up with a small group of my best bloggers friends to gift TWO WINNERS each with a $1,500 shopping spree to the retailer of their choice! 🙌🏻💗✨ Entering is super easy! All you have to do is these three steps:\n_\n1️⃣ like and save this photo 💗\n2️⃣ follow @bloggiveaway and everyone they are following! (Takes 10 seconds)\n3️⃣ tag 2 friends each in a separate comment in the comments below 💖 Get a bonus entry for liking the last three photos on each bloggers account\n💗 Get another bonus entry for following all bloggers on the free @liketoknow.it app - click the link in bio of @bloggiveaway for a link to each of our LTK accounts for easy following! Comment “LTK” if you do this option!\n_ \nClosing: Saturday 10/5/19 at midnight PST. The winner will be announced on 10/7/19. By entering, entrants confirm they are at least 18+ years of age, release Instagram of responsibility, and agree to abide by Instagram's terms of use. GOOD LUCK y’all! SHOP THIS DRESS HERE: @liketoknow.it #liketkit http://liketk.it/2FrBo", "label": []}, {"text": "Poison, Poison Ivy’s the name....\nI recreated & updated my Poison Ivy tutorial look from 2009😂 \nlast night for the @ysl X @iamhalsey GOTHAM CITY Costume Party.\n🍃🍃🍃🍃🍃🍃🍃🍃🍃🍃🍃🍃🍃🍃\n—————————————————————\nWHAT I USED: \n@yslbeauty Touché Eclat Blur Primer \n@clinique beyond Perfecting Foundation (3 shades)\n@maccosmetics 24 HOUR smooth wear concealer \n@maccosmetics x @patrickstarrr  Patrick’s Set Powder\n@toofaced Pineapple Paradise Strobing Bronzer \nEYES: \n@makeupforeverofficial Artist Color pencil in Absolute Emerald - I applied all over eyelid and around eye then put shadow on top\n@patmcgrathreal MTHRSHP Sublime Bronze Temptation Palette (the emerald green shade) \n@lorealmakeup voluminous Mascara \nSome cheap $2 lashes from @naimies \nLIP: @limecrimemakeup RED VELVET liquid lip\nWith @maccosmetics Lip liners mixed Nightmoth & Brick \nBROWS: I cut up ivy leaves from @michaelsstores and glued them on (just like my 2009 video😂😂) with @callas.iran Lash glue\nWIG: @mykie x @bellamihair collab red wig\n#poisonivy #poisonivycosplay #costume #makeup", "label": []}, {"text": "I discovered @hiddencrown a little while ago and I am loving their Halo Golden Beige Blonde extensions! They are super easy to style and use… its like having a great hair day everyday! Go to hiddencrownhair.com and use my code Crown10 for $10 off your order! #ad #hairgoals #goodhairdontcare", "label": []}, {"text": "Happy Monday. I hope you have a beautiful start to your week 🌺 #SwopesSelfie", "label": []}, {"text": "my lady @carlingnicole and i just released a new series of classes on @alo.moves designed to help you have healthy hips and hamstrings! 10 classes each with a unique purpose to help you feel better in your body, check them out today and use the promo code HEALTHY until noon tomorrow for a free trial 😊🙏🏼 #yogateachers", "label": []}, {"text": "<Brunching & bows // ready for spring and dining al fresco (cute floors a bonus)! These @anntaylor flats come in three adorable colors but are going fast. I linked to these as well some of my other favorite bow adorned shoes for spring here  http://liketk.it/2v9qb ❤️> #AnnTaylor #ATShoeGoals #AnnTaylorPartner #liketkit  @liketoknow.it", "label": []}, {"text": "Living for my hair right now 💕 I’ve gotten a lot of questions about my hair care lately after I started using @hairburst vitamins SO I thought it’d be a great idea to do a giveaway with these products! \nThe products include healthy hair vitamins, shampoo &conditioner, and eyelash growth serum 💆🏻‍♀️ The giveaway rules are simple: \ntag a friend in this pic and both must be following @hairburst to win the products in this photo \nwinner will be announced Dec. ‪20th‬\n\nGood luck! 💝", "label": []}, {"text": "If you’re out there holiday shopping, stop by @ultabeauty and stock up on @flawlesshairday to give the gift of nourished, flawless hair!", "label": []}, {"text": "✨ $1,200 SHOPPING SPREE! ✨ I’m teaming up with 9 of my favorite bloggers to give one of you a $1,200 shopping spree and entering is super easy! All you have to do is these three steps:\n1.) Like this photo\n2.) Follow @blushbabegifting and everyone they are following (only 10 bloggers total)\n3.) Tag a friend in the comments below!\n⭐️ BONUS ENTRY: Like our last 3 photos on IG + get a double bonus entry for every additional friend you tag below in a seperate comment! ⭐️\n_\nClosing: Sunday 1/20 at midnight PST. The winners will be announced on 1/22 and must be claimed within 48 hours. By entering, entrants confirm they are at least 18+ years of age, release Instagram of responsibility, and agree to abide by Instagram's terms of use. 💛\nshop this look: #liketkit @liketoknow.it http://liketk.it/2zoF5", "label": []}, {"text": "Bronzed & Blended 💦 #Giveaway\nWhose also obsessed with these sponges?! 🌟You & your BFF have a chance to win all these goodies! {Swipe to see prize} ✨ Just LIKE this photo ✨ TAG a friend who loves makeup ✨ FOLLOW @jadeywadey180 & @beautyblender ✨ I’ll choose  winners Sunday! Xx\n_ Swimsuit by @whitefoxswim\n_ Fanny Pack by @hudabeauty \n#jadeywadey180 #makeup", "label": []}, {"text": "Sunset - last evening 🌾 enjoying long walks by myself, calling a friend, listening to music, a podcast or just  nature ..", "label": []}, {"text": "🌴 Exploring the town in this sporty chic look. Btw, I bought this 🚴🏻‍♀️ biker shorts at @target for just $10 bucks 😮...super super comfy. #WheresGlamDapper in Bermuda 🇧🇲 at the enchanting @princessbermuda hotel & beach club #PoseOnPink #HamiltonPrincess", "label": []}, {"text": "<snagged this top on super sale thanks to @shopstyle // ‘tis the season for sale and in stories today I am showing some of the ways @shopstyle helps me save 💸> #shopyourstyle #ad", "label": []}, {"text": "Goodnight in the states. Good morning Greece from Astarte Suites Hotel 🇺🇸🇬🇷 It doesn't get much better than this 😍 @astarte_suites @santorini_greece", "label": []}, {"text": "Jet lagged is right- Does anyone else feel like they spend their life on an airplane? Spending this weekend with some girlfriends in Arizona then headed to a very special wedding next weekend! Hope you all are having an amazing weekend and staying warm 💕 Shop this super comfortable (and very relatable) sweater and all of my looks on the @liketoknow.it app, or click the link in my bio! #MamaNeedsANap #ICantNapUntilMarch #BecauseWeMoveTheWeekendAfterThat #JesusTakeTheWheel http://liketk.it/2u8Sn #liketkit #RHOD", "label": []}, {"text": "I told my mom years, I mean YEARS later that I never ate my vegetables at dinner time - I used to hide them in the drawers of her china cabinet behind the dining table. 😅 I told her this when I was like 22 years old. Y’all, she yanked my ass up so quick then sent me back to my own house mad. Like wtf. I’m grown! You can’t be doing me like this woman! I pay taxes! 😂🙈 Love you Mom.", "label": []}, {"text": "Happy 23rd Birthday to my forever little seesters ❤️👯‍♀️ I am so proud of you, I love watching you grow into the bold and beautiful women you are today. Here’s to more birthday celebrations together...but never growing up.", "label": []}, {"text": "I'm totally going to talk about god right now. This new thought life that god is everything or he is nothing has came into full continues thought throughout the last few days. Walking hand and hand with the spirit of the universe.  The truth is uncomfortable, disturbing, hard to hear and  also understand. Meditation, prayer, and journaling daily has provided me this new freedom. This is not something that I have invented. Being a spiritual being of peace, love, and compassion has been my goal for a very long time. I have suffered my entire life and felt separated from everyone. I am beyond grateful for my freedom and I seek more of this new freedom that god provides through silence. By no means is this anything more than a practice of killing my ego and having faith in the universe. 📸 @cheymolina", "label": []}, {"text": "Funny story about the time 2 girls had me confused at St. Edwards University in Austin, TX. Check out @garyowenpodcast on i tunes & YouTube. www.youtube.com/garyowencom", "label": []}, {"text": "Ready for #JerichoVsNaito2... #WrestleKingdom13 (jacket by @katelomaxart & tights by @kyllacustomrockwear)", "label": []}, {"text": "@1008silvia  last night in Singapore  for the launch of the new @marcbeauty's Eye-Conic Multi-Finish Eye Palettes. \nFACE\nUnder(cover) Perfecting Coconut Primer\nGenius Gel Foundation \"Golden Medium\"\nRemedy Concealer Pen \"Last Call\"\nGlow Stick \"Spotlight\"\nPerfection Powder \"Golden\"\nPerfecting Coconut Setting Mist\n\nBROWS\nBrow Wow Pencil \"Medium Brown\"\nBrow Tamer Clear Brow Gel\n\nEYES\n\"(Brown)ie\" Matte Highliner Gel Eye Crayon\n\"Blacquer\" Highliner Gel Eye Crayon\nEye-conic Multi-Finish Eye Palette \"Glambition\" + \"Edgitorial\" + \"Frivoluxe\"\nVelvet Noir Mascara\n\nCHEEKS\nO!Mega Bronzer \"Tan-Tastic!\"\nAir Blush \"Kink & Kisses\"\nGlow Stick \"Spotlight\"\n\nLIPS\n(P)outliner \"Currant Mood\"\nLe Marc Lip Creme \"Blow\"\n#MarcJacobs #MarcBeauty #MarcFam", "label": []}, {"text": "Spent time with this sweet baby in tonight’s episode of #RHOD.  Loved meeting all the precious rescued animals at the Wildlife Friends Foundation and learning about this incredible organization and all they do to save abused animals.  Please know before you ever ride an elephant the abuse that they suffer for monetary gain in the lucrative tourist industry.  For more info check out @wildlife_friends_foundation", "label": []}, {"text": "That time I fell into a #ketchupmustardcake slash #koolaidpickles slash #chocolatemayocake rabbit hole....", "label": []}, {"text": "my favorite dancing partner ✨💃🏼💃🏽 thankful for this sweet girl & our many beach dances / karaoke moments this trip #smileyfaces #samebrain 💙🎶 both outfit deets are on my #liketkit for y’all! @liketoknow.it http://liketk.it/2CPsK #myamaryllis #amaryllisabroad @amaryllis_apparel", "label": []}, {"text": "Another killer #Jerichopumpkin from @manniespumpkinart! Thx to my bro @garyholt_official for the hook up!", "label": []}, {"text": "Flexibility is just as important as strength when it comes to physical health. A healthy muscle contracts and opens equally. If the muscle is just receiving contractions and not stretches it’s going to be injured. It’s just a matter of time. Same thing goes for only being stretched and not strengthened. It’s like that with anything in life. If the focus is strictly on one specific aspect everything becomes imbalance. That imbalance takes us to a place of unmanageability and consequences. Creating balance is very important to living a great life and having long periods of quiet mind moments.\n #balance #sanclemente \nLens: @k_ce8", "label": []}, {"text": "Heading to Sicily to shoot my Italy @weworewhatswim collection with @onia tonight! Can’t wait for this one, launching May 1st! #oniaxweworewhat", "label": []}, {"text": "Three days to go until we get to share our big day with you!! #OliviaAndAlex Said Yes, this Friday on @TLCTVUK 🎉", "label": []}, {"text": "Moving my body during this time has not only helped with my attitude and mood, but has been therapy for my mind. It’s been amazing to see how the people I love most in the wellness space have adapted to our new normal offering free live workouts that have kept us active. I know sometimes it’s hard to feel motivated but those are the days that we need to work out even harder, so let’s continue to move together 👊🏻 wearing @fpmovement onesie #fpmovement #ad • what workouts are you guys loving?", "label": []}, {"text": "We’re so excited about all the birdies, from our end of season sale, flying off to new homes! We're frequently asked about the best ways to clean and care for your slings, so we thought it was a great time to go over the basics. 😊\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nCaring for linen is simple! \nWe recommend machine washing with cold water, on a gentle cycle (detergents free of optical brighteners and synthetic fragrance are suggested), then air dry. Pro tip: throw it over a shower rod for plenty of room to dry nice and smooth. 🙌🏽\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nYou can find even more, detailed instructions on our site, under Slings 101:  WildBird.co/pages/care-instructions", "label": []}, {"text": "DEEP FRIED BURRATA in the making from @bella_gioianyc!! 💥 Tag a friend who loves to @devour.cheese! 😋 #DEVOURPOWER\n▶️ YouTube: DevourPowerTV", "label": []}, {"text": "When asked what has had the most impact on my life and business, my answer is this...⠀\nPriority alignment.⠀\n⠀\nIn this tutorial, I will teach you how to get clarity on what is important and what is not...⠀\nSo that you can stay laser-focused on hitting your BIG goals for the year.⠀\n⠀\nGet free access here ➡️ https://utm.io/ukZ5⠀\n(Swipe UP ⬆️ in my IG stories)", "label": []}, {"text": "Pepe vs @jarrettjenks (I’ve lost mass due to soccer the past 5 months so I’m actually bigger by default)", "label": []}, {"text": "A new mantra for the tough times.⠀\nGo here ➡ Join 350K+ achievers each morning: http://utm.io/ueEq", "label": []}, {"text": "<lilac love in feathers, sparkle and a bit of flare // it is the season of style with @theoutnet - shop all the party looks including this one with the link in bio!> #THEOUTNET #SeasonOfStyle #lilac #ad #feathers", "label": []}, {"text": "Morning rituals always, even at the resort ☕️🧖🏼‍♂️\n-\nCoffee, Indra and cardio are morning-time favorites of mine; I like waking up early and by the time I’ve completed my favorite routine I feel full of energy and ready to take on my day 🏃‍♂️⚡️\n-\n@indralifestyle is now offering bundle packs allowing regular buyers to save on cost per bottle! Also free shipping will continue through the holidays!\n🔺Link is in my bio!\n-\n#deervalley #thechateaux #indra #indralifestyle #cbd #saturdaze #travel #lifestyle #wbffpro", "label": []}, {"text": "📚 Don’t know who’s more excited about Chanell’s first time in kindergarten, can’t wait 😊 #GlamDapperFamily", "label": []}, {"text": "Democratic presidential candidate Andrew Yang wants to give every American $1000/month and we debate who’s good at Math. @troubleman31 flames black conservative pain in the ass Candace Owens and more on the All New Morning Rush 🙌🏾 Video by @chuckteez 🔥", "label": []}, {"text": "“Stay STARVING. Be foolish.” -Steve Jobs & King Wes\nBest caption 👇🏿 will win $100!\n\nTAG 3 Amigos or Amigas.. Like Share and Comment your best caption 👇🏿 to win $100 Asap!\n\nAnd don’t you dare Zoom in and look at the letters on the wheel caps 🤐🤐🤐🔥😤because if you do.. you might quit your job and instantly feel Motivated to get off your A$$ and work 20 times as hard! Right now!\n\nTattoo these 2 words in your 🧠 right now \nIt’s Possible!!!! Let’s gooooo!! Much ❤️\nWes \nPS\nI need to get back to The states ASAP! I’m drooling 🤤 over this cutie 🚘 .. Lambo: $250,000\nWheels: $9,000\nWrap: $7,000\nFull Racing Exhaust: $15,000\nThe cost for the BELIEF it took to own it: Priceless!\n\n#wesleyvirgin #huracan #thinkdifferently #kingwes #lamborghini", "label": []}, {"text": "Tryin to holla... He's cute, I guess 🤗 #coyfortheboy ❤", "label": []}, {"text": "getting into the festive spirit with @nordicspirit_uk #nicotinepouches uches ❄☃ #nordicspirit #ad 18+ Contains Nicotine - Nicotine is an addictive substance. #anytimeanywhere", "label": []}, {"text": "This was not a popular request. Believe it or not. 😁 Just one of my favorite instrumentals that I finally felt like playing. #MC2 by the late great #JDILLA. Big S/O to @stonesthrow and @pntbtrwlf for what has turned into one of my favorite t-shirts 👸🏾♥️♠️ #thepocketqueen #practicemakespocket #groovetheory #thepocketclub #tbt", "label": []}, {"text": "Oh no they didn’t “per my last email”...😂🤣😂🤣😂 #Glam #Reply #formation", "label": []}, {"text": "Bette Davis is alive and well at Tea in Provincetown. @thejinkx has got it covered.", "label": []}, {"text": "I never post about my friend. \nPersonal thing, but I prefer to keep our memories and bond private and quiet. \nBut something about today compelled me as a moving reminder of how fragile life is for all of us. \nIt’s Paul’s birthday and rightfully so, his legacy celebrated around the world. \nOur friendship was bonded over our daughters, Meadow & Simone and the pride and protection we took being their fathers. \nAnd recently, I got a scare when I almost lost another friend on the road. \nAll this stuff got me thinking about how beautiful, yet wildly unpredictable life is. \nWe never know what’s around the corner, so we gotta live as greatly as we can in the honor of our loved ones and ancestors who are no longer with us. \nManuia le aso fanau, my friend. \n#livegreatly #pw", "label": []}, {"text": "WATERMELON MARGARITAS SERVED IN A WATERMELON at @loreleynyc! 🍉😎 80 ounces of watermelon margarita. 💪🏼 Available today through Saturday! Summer isn’t over yet! 🍹\n#DEVOURPOWER\n#DEVOURPOWERNYC\n#DEVOURPOWERLowerEastSide\n▶️ YouTube: DevourPowerTV (Subscribe!)", "label": []}, {"text": "Top ✌🏼memories from our trip: • sitting on the beach collecting rocks with Abrie. • teaching Sailie how to swim. . 〰️ sometimes it just the littlest things in life, isn’t it? 〰️ .\n\nThank you so much for the trip, @oceanpointranch! We made family memories to last a lifetime, & we can’t wait to visit again 💙. #lit_fam_love pc @allyssaashleephotography .\n\n@pacificahotels #pacificahotels .\n.\n.\n.\n.\n.\n\n#holdthemoments #familyvacation #travelcalifornia  #familyovereverything #childhoodunplugged #candidchildhood #magicofchildhood #ig_motherhood #mama #momlife #motherhood #bestvacations #bestofmom #livethelittlethings #ohheymama #flashesofdelight", "label": []}, {"text": "Happy new year! 💫 spent NYE with Mum & Dad in Dubai! I love you both, endlessly❤️🙈\nI learnt (still learn every day) so much from you ✨I am so grateful to have you by my side 🙏🏻 #Family", "label": []}, {"text": "Y'all tune into @nacionespn2 at 9pm eastern & watch tonight's show, getting my face beat before I go on air.", "label": []}, {"text": "Serving Nia Long, Halle Berry, “another sad love song” 90s Toni Braxton realness.", "label": []}, {"text": "Cincinnati 1 week from today I’m at The Taft Theater. Tickets are going FAST. December 2nd we gonna have the city on 🔥🔥🔥🔥. Go to www.garyowen.com for tix info. #Cincy #tafttheatre #GetSome", "label": []}, {"text": "You guys know I’m obsessed with blue light glasses and with all the added screen time we’ve been experiencing, our exposure to blue light radiation has increased dramatically. Idk if you know this, but blue light can also damage your skin. There’s a new brand that launched today that I’m eager to be trying @goodhabitskin (it protects against this and is also clean and cruelty free)! #thedewers #ad", "label": []}, {"text": "When your summer wardrobe is a wrap... dress that is ✨@nyandcompany #alltogethernow", "label": []}, {"text": "Looking back to my first memories with @Almay Trio✨\n•\nI have to confess that I’m always in a hurry and sometimes I have to do my make up in the car!🙈 So this Trio Pallet has helped me! It is easy to use on the go, it is comfortable, lightweight, and it works for day and night makeups!😌♥️\n•\nHave you ever had to do your make up in your car?👀🙈 #AlmayPartner", "label": []}]